# N과 M(5) (s3, 72.621%)
# source : https://www.acmicpc.net/problem/15654
# keyword : 조합
# return : 주어진 N개의 수에서 길이가 M인 수열 사전 순으로 출력

"""
1. 문제
- N개의 서로 다른 자연수가 주어졌을 때 길이가 M인 수열을 모두 사전 순으로 출력

2. 입력 및 제한
- N, M (1<=M<=N<=8)
- N개의 수 x (1<=x<=10,000)

3. 로직
- 정렬 + permutations
"""


import sys
from itertools import permutations
input = sys.stdin.readline
N, M = map(int, input().split())
nums = [*map(int, input().split())]
nums.sort()

for arr in permutations(nums, M):
    print(*arr, end=' ')
    print()


"""
테스트케이스

3 1
4 5 2

4 2
9 8 7 1

4 4
1231 1232 1233 1234

---결과 출력
2
4
5

1 7
1 8
1 9
7 1
7 8
7 9
8 1
8 7
8 9
9 1
9 7
9 8

1231 1232 1233 1234
1231 1232 1234 1233
1231 1233 1232 1234
1231 1233 1234 1232
1231 1234 1232 1233
1231 1234 1233 1232
1232 1231 1233 1234
1232 1231 1234 1233
1232 1233 1231 1234
1232 1233 1234 1231
1232 1234 1231 1233
1232 1234 1233 1231
1233 1231 1232 1234
1233 1231 1234 1232
1233 1232 1231 1234
1233 1232 1234 1231
1233 1234 1231 1232
1233 1234 1232 1231
1234 1231 1232 1233
1234 1231 1233 1232
1234 1232 1231 1233
1234 1232 1233 1231
1234 1233 1231 1232
1234 1233 1232 1231
"""