# N과 M(8) (s3, 78.893%)
# source : https://www.acmicpc.net/problem/15657
# keyword : 조합
# return : 문제의 조건을 만족하는 수열을 공백으로 구분하여 출력

"""
1. 문제
- 아래 조건을 만족하는 길이가 M인 수열 모두 출력
    - 주어진 N개의 자연수 중에서 M개
    - 같은 수 중복으로 골라도 됨
    - 고른 수열은 오름차순이어야 함 (A1<=A2<=...<=Ak)

2. 입력 및 제한
- N, M (1<=M<=N<=8)
- X1 ~ Xi ~ Xn (1<=Xi<=10,000)

3. 로직
- 재귀함수 사용
    - 종료 : arr 길이가 M이 되면 종료
    - 지속 : arr의 마지막 값과 같거나 큰 값을 arr에 추가
"""


import sys
input = sys.stdin.readline
N, M = map(int, input().split())
nums = sorted(map(int, input().split()))

def rec(arr, idx):
    if len(arr) == M:
        print(*arr, end=' ')
        print()
        return
    for i in range(idx, N):
        rec(arr+[nums[i]], i)

rec([], 0)


"""
테스트케이스

3 1
4 5 2
---
2
4
5

4 2
9 8 7 1
---
1 1
1 7
1 8
1 9
7 7
7 8
7 9
8 8
8 9
9 9

4 4
1231 1232 1233 1234
---
1231 1231 1231 1231
1231 1231 1231 1232
1231 1231 1231 1233
1231 1231 1231 1234
1231 1231 1232 1232
1231 1231 1232 1233
1231 1231 1232 1234
1231 1231 1233 1233
1231 1231 1233 1234
1231 1231 1234 1234
1231 1232 1232 1232
1231 1232 1232 1233
1231 1232 1232 1234
1231 1232 1233 1233
1231 1232 1233 1234
1231 1232 1234 1234
1231 1233 1233 1233
1231 1233 1233 1234
1231 1233 1234 1234
1231 1234 1234 1234
1232 1232 1232 1232
1232 1232 1232 1233
1232 1232 1232 1234
1232 1232 1233 1233
1232 1232 1233 1234
1232 1232 1234 1234
1232 1233 1233 1233
1232 1233 1233 1234
1232 1233 1234 1234
1232 1234 1234 1234
1233 1233 1233 1233
1233 1233 1233 1234
1233 1233 1234 1234
1233 1234 1234 1234
1234 1234 1234 1234
"""